import React from 'react'
import { styled } from '@mui/material/styles'
import { Typography, Container } from '@mui/material'
import Layout from './layouts/Layout'
import Link from './uiParts/Link'

const PREFIX = 'TermsOfServicePage'

const classes = {
  container: `${PREFIX}-container`,
  h1: `${PREFIX}-h1`,
  h2: `${PREFIX}-h2`,
  section: `${PREFIX}-section`,
  subtitle: `${PREFIX}-subtitle`,
  list: `${PREFIX}-list`,
  link: `${PREFIX}-link`,
}

const StyledLayout = styled(Layout)(({ theme }) => ({
  [`& .${classes.container}`]: {
    display: 'flex',
    justifyContent: 'center',
    flexDirection: 'column',
    maxWidth: 800,
  },

  [`& .${classes.h1}`]: {
    fontSize: '3rem',
    marginBottom: '3rem',
    fontWeight: 'bold',
    color: '#adce5d',
  },

  [`& .${classes.h2}`]: {
    fontSize: '2rem',
    fontWeight: 'bold',
    color: '#adce5d',
  },

  [`& .${classes.section}`]: {
    marginBottom: '3rem',
  },

  [`& .${classes.subtitle}`]: {
    fontWeight: 'bold',
    color: '#adce5d',
  },

  [`& .${classes.list}`]: {
    paddingLeft: '2em',
    listStyle: 'disc',
    marginBottom: theme.spacing(2),
    fontSize: '1rem',
    lineHeight: '1.5',
    letterSpacing: '0.00938em',
  },

  [`& .${classes.link}`]: {
    fontSize: '1rem',
    lineHeight: '1.5',
    letterSpacing: '0.00938em',
    color: '#adce5d',
    '&:hover': {
      textDecoration: 'underline',
    },
  },
}))

export default function TermsOfServicePage() {
  //Strings which contain apostrophes or quotes are placed insede
  //curly braces to properly escape these characters
  return (
    <StyledLayout title="Соглашение пользователя | Recycl">
      <Container className={classes.container}>
        <Typography
          variant="h1"
          align="center"
          className={classes.h1}
          id="user-agreement"
        >
          Угода користувача
        </Typography>
        <article style={{ textAlign: 'justify' }}>
          <section className={classes.section}>
            <Typography
              variant="h2"
              gutterBottom
              align="center"
              className={classes.h2}
              id="general-terms"
            >
              1. ЗАГАЛЬНІ ПОЛОЖЕННЯ
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>1.1</span> Онлайн-сервіс Recycl
              (далі також - «Сайт») - це платформа, яка допомагає переробникам
              побутових та промислових відходів (далі також «Сировина»)
              знаходити матеріали для переробки, а іншим фізичним та юридичним
              особам – передавати Відходи на переробку і організовувати їх
              сортування.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>1.2</span> У цій Угоді
              користувача терміни використовуються в таких значеннях:
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Адміністрація Сайту</span> –
              Приватне підприємство «Recycl World Company» і/або особи,
              уповноважені ним належним чином на управління Сайтом і надання
              послуг Користувачам.
            </Typography>
            <Typography gutterBottom>
              <span className={classes.subtitle}>Автор оголошення</span> -
              будь-яка дієздатна фізична особа, юридична особа чи відокремлений
              підрозділ, наділений правоздатністю, що публікують на Сайті
              оголошення з інформацією зокрема, але не виключно, про:
            </Typography>
            <ul className={classes.list}>
              <li>наявність у таких осіб Відходів;</li>
              <li>пункти прийому та/або збору Відходів;</li>
              <li>бажання здійснювати сортування Відходів.</li>
            </ul>

            <Typography paragraph>
              <span className={classes.subtitle}>Відвідувач</span> - будь-яка
              особа, яка має доступ до Сайту, за допомогою мережі Інтернет і
              використовує Сайт.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Власник Сайту</span> – Приватне
              підприємство «Recycl World Company» (ідентифікаційний код
              юридичної особи 12345678), є постачальником послуг проміжного
              характеру в інформаційній сфері в розумінні Закону України «Про
              електронну комерцію» і не є ініціатором передачі інформації.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Контент</span> - результати
              інтелектуальної діяльності, що охороняються, та які розміщуються
              Користувачем на Сайті, включаючи, але не обмежуючись: фотографії,
              рекламні матеріали, інформація про Користувача, відгуки,
              Оголошення тощо.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Користувач</span> -
              Відвідувачі, які зареєстровані на Сайті.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Обліковий запис</span> -
              електронний кабінет Користувача (аккаунт) у функціональній системі
              Сайту, який має унікальний ID, за допомогою якого Користувач може
              управляти своїми Сервісами. Оголошення - повідомлення з
              інформацією про наявність відходів, пункти збору відходів або
              бажання здійснювати сортування відходів, яке розміщується Автором
              оголошення. Зміст Оголошення повинен відповідати Правилам
              розміщення інформації на Сайті.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>
                Політика конфіденційності
              </span>{' '}
              {`- умови роботи з конфіденційною інформацією на Сайті, які є
              невід'ємною частиною цієї Угоди і розміщена за посиланням: `}
              <Link href="/privacy-policy" className={classes.link}>
                https://recycl.com/privacy-policy
              </Link>
              .
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Сайт</span>
              {` - сукупність
              програмних та апаратних засобів, результат комп'ютерного
              програмування у вигляді онлайн сервісу Recycl, який розміщений в
              мережі Інтернет за адресою `}
              <Link
                href={`${process.env.NEXT_PUBLIC_URL}`}
                className={classes.link}
              >
                https://recycl.com
              </Link>{' '}
              {`і належить ПП «Recycl World Company» (ідентифікаційний код
              юридичної особи 12345678). Зміст Сайту захищено авторським правом,
              законодавством про товарні знаки, а також іншими правами,
              пов'язаними з інтелектуальною власністю, і законодавством про
              недобросовісну конкуренцію.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Сировина</span> – промислові
              або побутові відходи.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>
                Правила розміщення інформації на Сайті
              </span>
              {` - вимоги, яких повинні дотримуватися Користувачі, щоб мати
              можливість розміщувати Оголошення на Сайті. Дані правила є
              невід'ємною частиною Угоди і розміщені за посиланням.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Розміщення Оголошення</span> -
              це дія Користувача (Автора оголошення), яка виражається в
              публікації одного Оголошення на Сайті Recycl.com, а також зміні
              чинного Оголошення.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Сервіси</span> - сукупність
              послуг, які надаються Користувачам на Сайті відповідно до цієї
              Угоди, на платній або безоплатній основі, в тому числі, але не
              виключно, послуги з розміщення та перегляду Оголошень, обміну
              повідомленнями, відображення інформації на мапі. Використання
              Сервісів регулюється чинним законодавством України.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>Угода</span> - Користувацька
              угода, яка розміщена за адресою:{' '}
              <Link href="/terms-of-service" className={classes.link}>
                https://recycl.com/terms-of-service
              </Link>
              {`. Під дію цієї Угоди підпадають всі існуючі (функціонуючі) на
              даний момент послуги (Сервіси) Сайту, а також будь-які їх подальші
              модифікації і ті, які з'являються в подальшому.`}
            </Typography>
          </section>
          <section className={classes.section}>
            <Typography
              variant="h2"
              gutterBottom
              align="center"
              className={classes.h2}
              id="description-of-service"
            >
              2. ОПИС ПОСЛУГ
            </Typography>
            <Typography gutterBottom>
              <span className={classes.subtitle}>2.1</span> Сайт надає своїм
              Користувачам такі послуги (зокрема, але не виключно):
            </Typography>
            <ul className={classes.list}>
              <li>
                розміщення Оголошень про наявність у Користувача відходів;
              </li>
              <li>
                розміщення Оголошень про пункти прийому та/або збору відходів;
              </li>
              <li>бажання Користувача здійснювати сортування відходів; </li>
              <li>ознайомлення з Оголошеннями інших Користувачів;</li>
              <li>обміну повідомленнями між Користувачами;</li>
              <li>розміщення реклами.</li>
            </ul>
            <Typography paragraph>
              <span className={classes.subtitle}>2.2</span> Після реєстрації на
              Сайті Користувач отримує доступ до розділу Сайту «Особистий
              кабінет», якому присвоюється унікальний ID-номер і в якому
              зберігається інформація про нього або компанію, яку він
              представляє, історія оголошень і комунікацій Користувачами та інша
              інформація.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>2.3</span> Власник Сайту не є
              стороною будь яких угод між Користувачами Сайту. Всі угоди між
              Авторами оголошень та іншими Користувачами укладаються
              безпосередньо, Власник Сайту не є учасником таких угод, а лише
              надає комунікаційну площадку для розміщення оголошень. Власник
              Сайту не несе відповідальності за зміст інформації, що
              передається, або одержуваної інформації і за шкоду, заподіяну в
              результаті використання Користувачами Сервісів Сайту.
            </Typography>
          </section>
          <section className={classes.section}>
            <Typography
              variant="h2"
              gutterBottom
              align="center"
              className={classes.h2}
              id="rights-and-obligations-of-site-administration"
            >
              {`3. ПРАВА ТА ОБОВ'ЯЗКИ АДМІНІСТРАЦІЇ САЙТУ`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>3.1</span>
              {`Адміністрація Сайту
              зобов'язується забезпечити можливість отримання Користувачем
              Сервісів в порядку, визначеному цією Угодою.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>3.2</span> Адміністрація Сайту
              залишає за собою право на власний розсуд змінювати або видаляти
              будь-яку інформацію, яка публікується Користувачами на Сайті,
              призупиняти, обмежувати або припиняти доступ Користувача до
              Сервісів Сайту в будь-який час та без пояснення причин.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>3.3</span> Адміністрація Сайту
              має право розміщувати рекламну і/або іншу інформацію в будь-якому
              розділі Сайту без узгодження з Користувачем.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>3.4</span> Адміністрація Сайту
              має право здійснювати розсилання Користувачам повідомлень
              (комерційних пропозицій), в тому числі електронних повідомлень на
              адреси наданої Користувачем електронної пошти або
              SMS/Viber-повідомлень на надані Користувачем номера його мобільних
              телефонів, що містять організаційно-технічну, інформаційну,
              маркетингову або іншу інформацію про можливості Сервісів на Сайті,
              діяльності Власника Сайту або його партнерів. Користувач у
              будь-який момент може відмовитися від подальшого отримання таких
              повідомлень.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>3.5</span>
              {`Адміністрація Сайту
              зобов'язується надавати Користувачу можливість отримання
              консультацій служби підтримки у разі зазначення Користувачем
              ідентифікаційних даних. Обсяг консультацій обмежується конкретними
              питаннями, пов'язаними з наданням Послуг.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>3.6</span> Адміністрація Сайту
              має право здійснювати модерацію всього Контенту та Оголошень на
              відповідність їх вимогам цієї Угоди, Правил розміщення інформації
              на Сайті та чинного законодавства України, і у разі виявлених
              порушень в будь-який час на свій розсуд видаляти таку інформацію з
              Сайту без пояснення причин.
            </Typography>
            <Typography gutterBottom>
              <span className={classes.subtitle}>3.7</span> Адміністрація Сайту
              має право в односторонньому порядку призупинити, обмежити або
              зупинити доступ Користувача до будь-якого із Сервісів Сайту в
              будь-який час та/або розірвати договір в односторонньому порядку у
              разі:
            </Typography>
            <ul className={classes.list}>
              <li>
                порушення Користувачем умов цієї Угоди або додатків до неї;
              </li>
              <li>
                отримання відомостей про незаконну діяльність Користувача;
              </li>
              <li>
                виявлення відомостей про спроби отримання неправомірної вигоди
                та/або ухилення від сплати послуг та/або недобросовісної
                конкуренції.
              </li>
            </ul>
            <Typography paragraph>
              <span className={classes.subtitle}>3.7.1</span> Факт порушення або
              виявлення відомостей вважається підтвердженим, якщо Адміністрація
              Сайту оповістила про це Користувача та/або обмежила доступ до
              Сервісів Сайту для такого Користувача.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>3.7.2</span> Акцептуючи дану
              Угоду, Користувачі надають згоду, що Адміністрація Сайту має право
              здійснювати перевірку інформації та/або документів, пов’язаних із
              оголошеннями Користувача, а також розсилок та відгуків.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>3.8</span> У разі, якщо ПП
              «Recycl World Company» виступає організатором чи партнером в
              рекламних акціях, бонусних програмах, спеціальних програмах
              лояльності та/або інших заходах, які передбачають надання
              заохочень Користувачам Сайту, як учасникам таких заходів, та у
              разі отримання відомостей про незаконну діяльність учасників таких
              заходів та/або встановлення фактів чи обставин, які вказують на
              те, що діяльність учасників має ознаки незаконної та/або порушує
              умови та/або правила проведення таких заходів, Адміністрація Сайту
              має право в односторонньому порядку призупинити, обмежити або
              зупинити доступ такого Користувача до будь-якого із Сервісів Сайту
              в будь-який час та/або розірвати договір в односторонньому
              порядку.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>3.9</span> Адміністрація Сайту
              з метою забезпечення безпеки Користувачів та роботи Сайту, а також
              з метою запобігання та зупинення шахрайських дій на Сайті має
              право запитувати документи, що ідентифікують Користувачів
              (фотографію Користувача в форматі селфі з відкритим паспортом,
              скан-копії (фотографії) паспорту Користувача, виписку з Єдиного
              державного реєстру юридичних осіб, фізичних осіб та громадських
              формувань для фізичних осіб та юридичних осіб). У випадку відмови
              надати документи, Адміністрація Сайту має право в односторонньому
              порядку призупинити, обмежити або зупинити доступ такого
              Користувача до будь-якого із сервісів в будь-який час та/або
              розірвати договір в односторонньому порядку.
            </Typography>
          </section>
          <section className={classes.section}>
            <Typography
              variant="h2"
              gutterBottom
              align="center"
              className={classes.h2}
              id="rights-and-obligations-of-site-user"
            >
              {`4. ПРАВА ТА ОБОВ'ЯЗКИ КОРИСТУВАЧА`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.1</span> Під час реєстрації
              та/або подачі Оголошення Користувач повинен надавати правдиву,
              точну і повну інформацію і підтримувати цю інформацію в стані, що
              відповідає дійсності. Користувач не має права вимагати від
              Адміністрації Сайту приховування будь-якої інформації про нього.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.2</span> У разі надання
              недостовірної або неповної інформації, Адміністрація Сайту має
              право призупинити або скасувати реєстрацію Користувача та
              припинити надання йому Послуг.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.3</span>
              {`Користувач
              зобов'язується використовувати Сайт тільки в законних цілях,
              дотримуватися чинного законодавства України, а також прав та
              законних інтересів Власника Сайту.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.4</span>
              {`Користувач не має
              права вчиняти дій, що впливають на нормальну роботу Сайту і є його
              несумлінним використанням. Користувач зобов'язується не
              використовувати будь-які пристрої, програми, процедури, алгоритми
              і методи, автоматичні пристрої або еквівалентні ручні процеси для
              доступу, придбання, копіювання або відстеження змісту Сайту.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.5</span>
              {`Користувач
              зобов'язується не здійснювати дій, спрямованих на отримання
              доступу до чужого особистого профілю/Облікового запису шляхом
              підбору логіна і пароля, злому або інших дій.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.6</span> Користувач не має
              права передавати, відступати, продавати, передавати в користування
              тощо свої логін і пароль для доступу до Сайту і Сервісів, а також
              права на Сайт, третім особам без згоди Адміністрації Сайту. У разі
              передачі логіна і пароля або прав на Сайт будь-третій особі, вся
              відповідальність за дії такої третьої особи після цього несе
              Користувач.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.7</span>
              {`У разі порушення
              безпеки або несанкціонованого використання Облікового запису
              Користувача, він повинен негайно повідомити про це Адміністрацію
              Сайту. Адміністрація Сайту не несе відповідальності за будь-які
              збитки, спричинені несанкціонованим використанням Облікового
              запису Користувача. Користувач не може використовувати пароль і
              Обліковий запис іншого Користувача без спеціального дозволу і
              згоди власника цього Облікового запису і пароля. Адміністрація
              Сайту не несе відповідальності за будь-які збитки чи шкоду, що
              виникли внаслідок невиконання Користувачем цих зобов'язань.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.8</span>
              {`Користувач
              зобов'язується не використовувати самостійно або із залученням
              третіх осіб можливості Сайту з метою, які можуть бути
              кваліфіковані як порушення прав третіх осіб на об'єкти
              інтелектуальної власності, недобросовісна конкуренція, інше
              порушення чинного законодавства України. Користувач не має права
              використовувати інформацію Сайту для особистих некомерційних
              цілей. Копіювання інформації з сайту забороняється.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.9</span> Користувачі
              гарантують, що володіють всіма правами на використання матеріалів
              та Контенту, що розміщуються ними на Сайті, у т.ч. правами
              інтелектуальної власності.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.10</span>
              {`Користувач
              зобов'язується надати за запитом від Адміністрації Сайту додаткову
              інформацію, яка має безпосереднє відношення до надання Сервісів
              (послуг).`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.11</span>
              {`Користувач
              зобов'язується дотримуватися майнових та немайнових прав авторів
              та інших правовласників при використанні Сайту.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>4.12</span>
              {`Користувачі Сайту
              зобов'язуються не допускати в адресу і щодо інших користувачів,
              Адміністрації та представників Сайту виразів і висловлювань у
              брутальній, образливій формі, проявляти агресію і застосовувати в
              своїх висловлюваннях (як усних, так і письмових) ненормативну
              лексику. У разі отримання скарги або фіксації Адміністрацією Сайту
              перерахованих вище дій, такого Користувачеві виставляється
              попередження. При наявності зафіксованого порушення два і більше
              рази, Адміністрація Сайту має право обмежити доступ такого
              Користувача до Сайту.`}
            </Typography>
          </section>
          <section className={classes.section}>
            <Typography
              variant="h2"
              gutterBottom
              align="center"
              className={classes.h2}
              id="content-requirements"
            >
              5. ВИМОГИ ДО КОНТЕНТУ. РОЗМЕЖУВАННЯ ВІДПОВІДАЛЬНОСТІ
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>5.1</span> Публікація
              інформації (Контенту) на Сайті повинна здійснюватися в повній
              відповідності з вимогами чинного законодавства України, положень
              цієї Угоди та{' '}
              <Link
                href="/information-placement-rules"
                className={classes.link}
              >
                Правил розміщення інформації на Сайті.
              </Link>
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>5.2</span>
              {`Адміністрація Сайту
              не проводить обов'язкову перевірку інформації і Контенту (в тому
              числі в оголошеннях), яка розміщується Користувачами на Сайті і не
              несе відповідальності за відповідність такої інформації чинному
              законодавству України.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>5.3</span>
              {`Адміністрація Сайту
              не несе відповідальності за помилки, неточності, упущення, які
              були допущені при реєстрації або розміщенні інформації
              Користувачем, а також будь-які матеріальні або нематеріальні
              збитки, що виникли в зв'язку з цим (включаючи упущену вигоду).`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>5.4</span> Адміністрація Сайту
              не несе відповідальності за використання (як правомірне, так і
              неправомірне) третіми особами інформації, розміщеної на Сайті,
              включаючи її відтворення і поширення, здійснені як в рамках Сайту,
              так і іншими можливими способами.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>5.5</span> Адміністрація Сайту
              залишає за собою право в односторонньому порядку видаляти
              розміщений Користувачами Контент на вимогу правовласників або
              компетентних державних органів, а також у разі, якщо розміщений
              Контент порушує права (у т.ч. права інтелектуальної власності)
              третіх осіб, або не відповідає, на думку адміністрації Сайту,
              принципам суспільної моралі. Адміністрація Сайту також має право
              вимагати у Користувача підтверджуючі документи на розміщений
              Контент.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>5.6</span>
              {`У разі виникнення в
              зв'язку з розміщенням Користувачем Контенту та/або будь-якої
              інформації, рекламних матеріалів, та/або змістом рекламних
              матеріалів (відповідністю змісту реклами вимогам чинного
              законодавства) та/або якістю товарів/послуг, які рекламуються,
              претензій, суперечок застосування штрафних санкцій з боку третіх
              осіб та/або контролюючих органів або за рішенням суду, такий
              Користувач зобов'язується розглядати та вирішувати ці питання
              самостійно без залучення Адміністрації Сайту, а також
              зобов'язується компенсувати Власнику Сайту в повному обсязі
              збитки, витрати, включаючи штрафні санкції, викликані порушенням
              ним умов цієї Угоди.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>5.7</span> Вся розміщена
              Користувачами на Сайті інформація вважається власністю
              Користувачів, які її розмістили, до тих пір, поки не буде підстав
              вважати інакше. Всю відповідальність за відповідність такої
              інформації (Контенту) законодавству України несуть такі
              Користувачі. Користувачі Сайту не отримують ніяких прав на
              використання інформації, розміщеної іншими Користувачами і несуть
              повну відповідальність перед власником інформації за її
              неправомірне використання.
            </Typography>
          </section>
          <section className={classes.section}>
            <Typography
              variant="h2"
              gutterBottom
              align="center"
              className={classes.h2}
              id="responsibility"
            >
              6. ВІДПОВІДАЛЬНІСТЬ. ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>6.1</span>
              {`Адміністрація Сайту
              не несе відповідальності за будь-які помилки, упущення,
              переривання, дефекти і затримки в обробці або передачі даних, збої
              в лініях зв'язку, знищення будь-якого обладнання, неправомірний
              доступ третіх осіб до Сайту, що стали причиною обмеження доступу
              Користувача до Сервісів. Адміністрація Сайту не несе
              відповідальності за будь-які технічні збої або інші проблеми
              будь-яких телефонних мереж або служб, комп'ютерних систем,
              серверів або провайдерів, комп'ютерного або телефонного
              обладнання, програмного забезпечення, збоїв сервісів електронної
              пошти або скриптів з технічних причин, за нормальне функціонування
              і доступність окремих сегментів мережі Інтернет та мереж
              операторів електрозв'язку, задіяних при здійсненні доступу
              Користувача до Сервісів.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>6.2</span> Послуги на Сайті
              надаються «як є». Адміністрація Сайту не гарантує безумовного
              збереження Облікового запису Користувача, та розміщеної
              Користувачем інформації на Сайті.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>6.3</span>
              {`Адміністрація Сайту
              не несе відповідальності за відповідність Сервісу цілком або його
              частин очікуванням Користувача, безпомилкове та безперебійне
              надання Сервісів, припинення доступу Користувача до Сервісів, а
              також за збереження логіна і пароля Користувача, що забезпечують
              доступ до Сервісів, з причин, пов'язаних з технічними збоями
              апаратного або програмного забезпечення Сайту, і не відшкодовує
              Користувачу будь-які пов'язані з цим збитки.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>6.4</span>
              {`Адміністрація Сайту
              не несе відповідальності перед Користувачем за обмеження доступу
              до Сервісів, за припинення доступу до Сервісів, якщо ці обмеження
              і припинення виникли внаслідок обставин непереборної сили, що
              виникли після укладення цього Договору та на настання яких Сторони
              не могли вплинути, включаючи, але не обмежуючись, наступним:
              війна, заколоти, страйки, саботаж, ембарго, пожежі, повені,
              стихійні лиха, погіршення радіоелектронної або радіологічної
              обстановки, вибухи, дії або бездіяльність уряду України або іншої
              країни, акти державних органів і/або органів місцевого
              самоврядування, внесення змін до законодавства України, аварії на
              мережах загального користування, зміни умов доступу до
              лінійно-кабельним засобів зв'язку та інше.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>6.5</span>
              {`Адміністрація Сайту
              не несе відповідальності перед Користувачем або будь-якими третіми
              особами за будь-які прямі та/або непрямі збитки, включаючи упущену
              вигоду або втрачені дані, шкоду честі, гідності або діловій
              репутації, понесені у зв'язку з використанням ним Сервісів, або
              неможливості його використання або несанкціонованого доступу
              третіх осіб до комунікацій Користувача.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>6.6</span>
              {`Адміністрація Сайту
              не несе відповідальності за будь-які збитки електронним пристроям
              Користувача або іншої особи, будь-якого іншого обладнання або
              програмного забезпечення, викликаний або пов'язаний з
              використанням Користувачем Сервісів.`}
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>6.7</span> Адміністрація Сайту
              не несе відповідальності перед Користувачами або іншими третіми
              особами щодо змісту, законності, достовірності і повноти
              інформації (Контенту), що надається/одержується Користувачем при
              використанні Сервісів.
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>6.8</span> Адміністрація Сайту
              не несе відповідальність за будь-які збитки, що прямо або побічно
              виникли у Користувачів в результаті діяльності інших Користувачів
              Сайту. Адміністрація Сайту ні за яких обставин не несе
              відповідальності перед Користувачами або третіми особами за
              будь-які непрямі збитки, у тому числі упущену вигоду.
              Відповідальність Адміністрації Сайту обмежується прямими
              документально підтвердженими збитками, що наступили в результаті
              дії або бездіяльності Адміністрації Сайту в розмірі, що не
              перевищує вартість наданих послуг окремо взятому Користувачеві.
            </Typography>
            <Typography gutterBottom>
              <span className={classes.subtitle}>6.9</span> Адміністрація Сайту
              залишає за собою право видаляти або блокувати доступ до
              інформації, розміщеної Користувачем, без попередження, у випадках:
            </Typography>
            <ul className={classes.list}>
              <li>
                {`отримання обов'язкових до виконання рішень компетентних
                державних органів України;`}
              </li>
              <li>
                вимог власників прав інтелектуальної власності, у т.ч., але не
                обмежуючись, авторських або суміжних прав, прав на знаки для
                товарів та послуг, на винаходи та корисні моделі, на промислові
                зразки тощо, про припинення порушень його прав Користувачем на
                Сайт;
              </li>
              <li>
                іншого порушення прав або законних інтересів інших Користувачів
                Сайту, юридичних і фізичних осіб за їх мотивованим зверненням (у
                тому числі в разі порушень прав споживачів);
              </li>
              <li>
                виявлення інформації, яка заборонена до розміщення на Сайті або
                не відповідає вимогам цієї Угоди (разом з додатками);
              </li>
              <li>
                виявлення інформації, що свідчить про несумлінне використання
                Сайту Користувачем, надання ним недостовірної інформації,
                здійснення діяльності з порушенням вимог чинного законодавства
                України.
              </li>
            </ul>
            <Typography paragraph>
              <span className={classes.subtitle}>6.10</span>
              {`Адміністрація Сайту
              не несе відповідальність за дії систем переказів, платіжних систем
              і за затримки пов'язані з їх роботою.`}
            </Typography>
          </section>
          <section className={classes.section}>
            <Typography
              variant="h2"
              gutterBottom
              align="center"
              className={classes.h2}
              id="intelectual-property"
            >
              7. ІНТЕЛЕКТУАЛЬНА ВЛАСНІСТЬ
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>7.1</span>
              {`Сукупність програм,
              даних, торгових марок, об'єктів авторського права, і інших
              об'єктів, що використовуються на Сайті при наданні Сервісів, є
              інтелектуальною власністю його законних правовласників і
              охороняються законодавством про інтелектуальну власність України,
              а також відповідними міжнародними правовими договорами і
              конвенціями. Будь-яке використання елементів, символіки, текстів,
              графічних зображень, програм та інших об'єктів, що входять до
              складу Сервісів і належать Сайту, крім дозволеного в цій Угоді,
              без дозволу Адміністрації Сайту чи іншого законного правовласника
              є незаконним і може стати причиною судового розгляду і притягнення
              порушників до цивільно-правової, адміністративної та кримінальної
              відповідальності відповідно до законодавства України.`}
            </Typography>
          </section>
          <section className={classes.section}>
            <Typography
              variant="h2"
              gutterBottom
              align="center"
              className={classes.h2}
              id="additions-to-the-agreement"
            >
              8. ДОДАТКИ ДО УГОДИ
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>8.1</span> Політика
              конфіденційності знаходиться за{' '}
              <Link href="/privacy-policy" className={classes.link}>
                посиланням
              </Link>
              .
            </Typography>
            <Typography paragraph>
              <span className={classes.subtitle}>8.2</span> Правила розміщення
              інформації на Сайті знаходяться за{' '}
              <Link
                href="/information-placement-rules"
                className={classes.link}
              >
                посиланням
              </Link>
              .
            </Typography>
          </section>
        </article>
      </Container>
    </StyledLayout>
  )
}
