const cardsContent = [
  {
    title: 'Для тех, кто принимает или перерабатывает вторсырье и отходы',
    description: [
      {
        text: 'Находите объявления о наличии вторсырья, которое пользователи хотят передать на переработку или утилизацию.',
        href: '/ads',
      },
      {
        text: 'Добавляйте информацию о местоположении стационарных или передвижных пунктов приема вторсырья, а также об сортировочных контейнерах.',
        href: '/my/collection-points/create',
      },
      {
        text: 'Подпишитесь на получение уведомлений о появлении неподалеку от вас вторсырья, которое вы принимаете или перерабатываете.',
        href: '/my/subscriptions',
      },
    ],
  },
  {
    title: 'Для тех, кто хочет сдать вторсырье на переработку или утилизацию',
    description: [
      {
        text: 'Находите пункты приема вторсырья вблизи от вас.',
        href: '/collection-points',
      },
      {
        text: 'Добавляйте объявления о наличии у вас вторсырья, которое вы хотите сдать на переработку или утилизацию.',
        href: '/my/ads/create',
      },
      {
        text: 'Подпишитесь на получение уведомлений о появлении вблизи от вас пунктов приема вторсырья.',
        href: '/my/subscriptions',
      },
    ],
  },
]
export default cardsContent
