const cardsContent = [
  {
    title: 'Для переработчиков',
    description: [
      'Находите новых партнеров.',
      'Находите сырье для переработки.',
      'Работaйте с новыми видами сырья, которые нужны рынку.',
    ],
  },
  {
    title: 'Для бизнеса',
    description: [
      'Привлекайте новых клиентов, устанавливая места для раздельного сбора и гарантированно избавляйтесь от отходов.',
      'Экономьте на утилизации, сдавая отходы тем, кому они нужны.',
    ],
  },
  {
    title: 'Для общественности',
    description: [
      'Находите места приема отходов.',
      'Подавайте заявки на вывоз и участие в сортировке.',
    ],
  },
]
export default cardsContent
